[[Задачи]]
[[Ответы на возможные вопросы]]

class A:
    x = 1
a = A()
a.x = 2
print(A.x) 
Что выведет программа?

Что такое concurrency, как работает?

Как устроена память в питоне?

Почему enumerate() использовать выгоднее, чем range(len())?

Что такое Wheel-файлы?

(for i in range(3)) какой тип данных?

в чём разница set и dict, и почему для сета нужно хеширования?

Конвертер систем счисления: напишите функцию для перевода числа из любой системы (от 2 до 36) в 10-ую

Польский калькулятор: реализуйте вычислений выражения, запичанного в обратной  польской  нотации используя стек

Напишите программу которая переводит целое число от 0 до 999 в текстовое представление на русском или английском 

Реальзуйте простейший односвязный список

Написать класс итераторов который генерирует геометрическую прогрессию

функция проверки строки на палиндром

Кэширование: Реализуйте простейший декоратор @Iru_cache (мемоизация) для функции вычисления чисел Фибоначчи с использованием словаря.

написание мемоизации

По практике точно были задачи на польский калькулятор, наследование классов, у меня Напишите функцию на определение "счастливого" числа, такого что сумма квадратов его цифр в цикле сходиться к 1

Напишите функцию Проверки скобочной последовательности из (, [, { на корректность

from dataclasses import dataclass
@dataclass
class Point:
    x: int
    y: int 
p = Point(4,5)
print(p)
Что выведет программа? 

Когда интернирование двух независимо созданных объектов даст True на примере целых чисел и строк (a is b)?

X = "hello"  
Y= "hello"  
Print(X is Y)
Что выведет программа? 

Что возвращает yield?

Как сохранить decimal или datatime в json?

Что вернет корутина если убрать слово await? 

Как получить первый и последний элемент списка без обращения по индексам и срезам? 

Какая ошибка выведется при бесконечной рекурсии?

Какие есть синтаксические особенности у лямбда функции?

Какие алгоритмы сортировки «под капотом» у list.sort() и sorted()? Какие у них особенности?

что делает метод ___str___? 

почему threads плохо работает с asyncio? 

внутри with as выполняется деление на 0, закроется ли файл?

что такое hasattr, getattr, setattr? 

Функция бинпоиска

В чем разница между списками и кортежами Python?

Что такое PEP 8?

Как работают словари в Python и какова их внутренняя реализация?

Объясните работу с исключениями в Python.

Что такое генераторы и генераторные выражения?

Как работают списковые включения (list comprehensions)?

Объясните разницу между методами **_new_** и **_init__**

Что такое менеджеры контекста и как их использовать?

Как работает сборщик мусора в Python?

Что такое декораторы и как они работают? 

Объясните Global Interpreter Lock (GIL) и его влияние на многопоточность в Python.

Как работают метаклассы в Python и для чего они используются?

Объясните принцип работы декораторов с параметрами.

Как работают дескрипторы и когда их стоит использовать?

Объясните различия между **_getattr_**, **_getattribute ** и дескрипторами.

Какие методы оптимизации производительности Python-кода вы знаете?

Объясните работу с асинхронным программированием в Python (asyncio).

Как работают генераторы и корутины? В чем разница между ними?

Объясните процесс импорта модулей в Python систему поиска модулей.

Какие паттерны проектирования вы использовали в Python-проектах?

Как работает управление памятью в Python?

Что такое контекстные переменные и как их использовать?

Объясните принцип работы property-декораторов и их преимущества.

Какие проблемы могут возникнуть при работе с многопоточностью/многопроцессностью и как их решать?

Расскажите о модуле collections в стандартной библиотеке Python.

Объясните принципы работы интерпретатора Python и этапы выполнения кода.

Расскажите об устройстве объектной модели Python.

Как работают slots и когда их следует использовать?

Объясните работу с многопоточностью в Python и ограничения GIL. Как оптимизировать многопоточные программы,

Расскажите о современных подходах к конкурентному программированию в Python.

Как проводить профилирование Python-кода и оптимизировать узкие места?

Расскажите о типизации в Python. Как использовать статическую типизацию и ее преимущества?

Объясните принципы метапрограммирования в Python и когда его следует применять.

Какие существуют альтернативные реализации Python и их особенности?

Как работает интеграция Python c C/C++ кодом? Расскажите о различных подходах.

Объясните принципы Clean Architecture в контексте Python-приложений.

Расскажите о принципах эффективного тестирования Python-кода.

Как обеспечить устойчивость и отказоустойчивость в Python-приложениях?
